RETRIEVE_PROMPT = \
"""
Ты агент, который используется на начальной стадии работы RAG-системы.
тебе будет дан запрос пользователя, касающийся информации в базе знаний.
Твоя задача трансформировать, перефразировать запрос пользователя так, чтобы при поиске при помощи косинусного расстояния в векторной базе информация находилась точнее.
Запрос пользователя: {request}
Выведи только трансформированный запрос одной строкой, не давай дополнительные описания
"""

MAP_REDUCE_PROMPT = \
"""
На основе запроса пользователя выбери наиболее соответствующие отрывки текста.
Если отрывок не содержит информации, которую ищет человек, не добавляй его в итоговый список 
Запрос пользователя: {request}
Доступные отрывки текста: {info}
Верни список только с релевантными новостями
Ответ верни в формате списка:
[
"первый отрывок",
"второй отрывок",
...
]
Не выводи дополнительной информации, начни отвечать с [
"""

GENERATE_FINAL_ANSWER_PROMPT = \
"""
Ты агент поддержки и отвечаешь на ответы пользователя по предоставленной информации.
Тебе будет дан запрос и информация, на основании которой ты должен сформировать подробный, красиво оформленный ответ.
Не добавляй дополнительной информации от себя, отвечай только по предоставленной информации.

Запрос пользователя: {request}
Информация для ответа на вопрос: {info}
"""

IS_BAD_ANSWER = \
"""
Ваш запрос не соответствует целевой функции данного проекта, которая заключается в предоставлении актуальной информации по переданной информации.
"""

IS_NO_ANSWER = \
"""
К сожалению, по вашему запросу не удалось найти подходящей информации. Попробуйте изменить запрос или уточнить параметры поиска.
"""

FILTER_BAD_REQUEST_PROMPT = \
"""
Ты агент, проверящий соответствие запроса пользователя тематике проекта.
Тематика проекта:
Предоставление какой-то информации, инструкций, ответы на вопросы.
Запрос не должен содержать требований сделать что-либо, оскорблений, только вопросы, на которые можно предоставить какую-то инфрмацию.
Верни JSON в таком формате:
{{
"result": "..." // "no", если запрос не соответствует тематике, "yes" - если соответствует
}}
Запрос: {request}
Начни отвечать с {{"result":
"""